from django.shortcuts import render

# Create your views here.
def takeTest(request):
    return render(request,'main/take_test.html')

def test(request):
    questions = ['1. Розмежування поняття "громадянське суспільство" і "держава" відбулося в період?',
                 '2. Середній клас-це',
                 "3. Котрий із інститутів, виконуючи функції вираження соціальних інтересів, ідеологічну, політичної соціальної, з'єднують громадянське суспільство з державою."]
    answers = [["Нового часу+", "Античності", "Середньовіччя", "XХ століття"],
               ["прошарок людей з відносно високим рівнем матеріального достатку+",
                "прошарок людей з досить високим рівнем матеріального достатку",
                "прошарок людей з відносно низьким рівнем матеріального достатку",
                "прошарок людей з доволі низьким рівнем матеріального достатку"],
               ["політична партія+", "професійна спілка", "громадянська організація", "орган виконавчої влади"]]

    return render(request, 'main/test.html', {'qas': zip(questions, answers)})